**Assignment 2 - Pandas**

**1.	Import the attached Netflix csv file in Jupyter notebook and perform following operations using Pandas:**

In [167]:
import pandas as pd
import numpy as np
df=pd.read_csv('C:/Users/under/Downloads/netflix.csv')

In [169]:
df

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ..."
...,...,...,...,...,...,...,...,...,...,...,...
8775,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers"
8776,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies"
8777,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies"
8778,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies"
8779,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals"

**a)Print the first 5 rows and last 5 rows of the dataframe**

In [172]:
print(df.head())
print(df.tail())

  show_id     type                  title         director  \
0      s1    Movie   Dick Johnson Is Dead  Kirsten Johnson
1      s2  TV Show          Blood & Water              NaN
2      s3  TV Show              Ganglands  Julien Leclercq
3      s4  TV Show  Jailbirds New Orleans              NaN
4      s5  TV Show           Kota Factory              NaN

                                                cast        country  \
0                                                NaN  United States
1  Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...   South Africa
2  Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...            NaN
3                                                NaN            NaN
4  Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...          India

           date_added  release_year rating   duration  \
0  September 25, 2021          2020  PG-13     90 min
1  September 24, 2021          2021  TV-MA  2 Seasons
2  September 24, 2021          2021  TV-MA   1 Season
3  September 24, 2021          2021  TV-MA   1 Season
4  September 24, 2021          2021  TV-MA  2 Seasons

                                           listed_in
0                                      Documentaries
1    International TV Shows, TV Dramas, TV Mysteries
2  Crime TV Shows, International TV Shows, TV Act...
3                             Docuseries, Reality TV
4  International TV Shows, Romantic TV Shows, TV ...
     show_id     type        title         director  \
8775   s8803    Movie       Zodiac    David Fincher
8776   s8804  TV Show  Zombie Dumb              NaN
8777   s8805    Movie   Zombieland  Ruben Fleischer
8778   s8806    Movie         Zoom     Peter Hewitt
8779   s8807    Movie       Zubaan      Mozez Singh

                                                   cast        country  \
8775  Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...  United States
8776                                                NaN            NaN
8777  Jesse Eisenberg, Woody Harrelson, Emma Stone, ...  United States
8778  Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...  United States
8779  Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...          India

             date_added  release_year rating   duration  \
8775  November 20, 2019          2007      R    158 min
8776       July 1, 2019          2018  TV-Y7  2 Seasons
8777   November 1, 2019          2009      R     88 min
8778   January 11, 2020          2006     PG     88 min
8779      March 2, 2019          2015  TV-14    111 min

                                           listed_in
8775                  Cult Movies, Dramas, Thrillers
8776          Kids' TV, Korean TV Shows, TV Comedies
8777                         Comedies, Horror Movies
8778              Children & Family Movies, Comedies
8779  Dramas, International Movies, Music & Musicals

**b)	Check how many rows and columns are there using Pandas function.**

In [175]:
rows, columns = df.shape
print(f"Number of rows: {rows}")
print(f"Number of columns: {columns}")

Number of rows: 8780
Number of columns: 11

**c) Print all the column names**

In [178]:
print(df.columns)

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in'],
      dtype='object')

**d) Calculate the descriptive statistics of all the variables (integer/float/object, etc.)**

In [187]:
print(df.describe(include='all'))

       show_id   type                 title       director  \
count     8780   8780                  8780           6150
unique    8780      2                  8780           4516
top         s1  Movie  Dick Johnson Is Dead  Rajiv Chilaka
freq         1   6110                     1             19
mean       NaN    NaN                   NaN            NaN
std        NaN    NaN                   NaN            NaN
min        NaN    NaN                   NaN            NaN
25%        NaN    NaN                   NaN            NaN
50%        NaN    NaN                   NaN            NaN
75%        NaN    NaN                   NaN            NaN
max        NaN    NaN                   NaN            NaN

                      cast        country       date_added  release_year  \
count                 7956           7952             8770   8780.000000
unique                7671            745             1765           NaN
top     David Attenborough  United States  January 1, 2020           NaN
freq                    19           2809              108           NaN
mean                   NaN            NaN              NaN   2014.178474
std                    NaN            NaN              NaN      8.827938
min                    NaN            NaN              NaN   1925.000000
25%                    NaN            NaN              NaN   2013.000000
50%                    NaN            NaN              NaN   2017.000000
75%                    NaN            NaN              NaN   2019.000000
max                    NaN            NaN              NaN   2021.000000

       rating  duration                     listed_in
count    8776      8780                          8780
unique     14       220                           514
top     TV-MA  1 Season  Dramas, International Movies
freq     3198      1788                           361
mean      NaN       NaN                           NaN
std       NaN       NaN                           NaN
min       NaN       NaN                           NaN
25%       NaN       NaN                           NaN
50%       NaN       NaN                           NaN
75%       NaN       NaN                           NaN
max       NaN       NaN                           NaN

**e) Check the number of unique values for each column**

In [190]:
unique_values = df.nunique()
print(unique_values)

show_id         8780
type               2
title           8780
director        4516
cast            7671
country          745
date_added      1765
release_year      74
rating            14
duration         220
listed_in        514
dtype: int64

**f) Check the percentage of missing values for each column**

In [195]:
missing_percentage = (df.isnull().sum() / len(df)) * 100
print(missing_percentage)

show_id          0.000000
type             0.000000
title            0.000000
director        29.954442
cast             9.384966
country          9.430524
date_added       0.113895
release_year     0.000000
rating           0.045558
duration         0.000000
listed_in        0.000000
dtype: float64

**g) Delete all the rows where the 'Director' column has missing values**

In [200]:
df1 = df.dropna(subset=['director'])

In [202]:
rows, columns = df1.shape
print(f"Number of rows: {rows}")
print(f"Number of columns: {columns}")

Number of rows: 6150
Number of columns: 11

**h)Print all the records where country has Germany value (including West Germany).If any other country is there along with Germany, then that row should also come in output.**

In [209]:
germany_records = df1[df1['country'].str.contains('Germany', case=False, na=False)]
print(germany_records)

     show_id   type                                title  \
7         s8  Movie                              Sankofa
12       s13  Movie                         Je Suis Karl
129     s130  Movie                   An Unfinished Life
142     s143  Movie                      Freedom Writers
172     s173  Movie                       School of Rock
...      ...    ...                                  ...
8590   s8618  Movie                                Trash
8634   s8662  Movie                      Unfinished Song
8641   s8669  Movie                       V for Vendetta
8702   s8730  Movie                   Where the Money Is
8718   s8746  Movie  Willy Wonka & the Chocolate Factory

                  director                                               cast  \
7             Haile Gerima  Kofi Ghanaba, Oyafunmike Ogunlano, Alexandra D...
12     Christian Schwochow  Luna Wedler, Jannis Niewöhner, Milan Peschel, ...
129        Lasse Hallström  Robert Redford, Jennifer Lopez, Morgan Freeman...
142    Richard LaGravenese  Hilary Swank, Patrick Dempsey, Scott Glenn, Im...
172      Richard Linklater  Jack Black, Joan Cusack, Mike White, Sarah Sil...
...                    ...                                                ...
8590        Stephen Daldry  Wagner Moura, Martin Sheen, Rooney Mara, Selto...
8634  Paul Andrew Williams  Terence Stamp, Gemma Arterton, Christopher Ecc...
8641        James McTeigue  Natalie Portman, Hugo Weaving, Stephen Rea, St...
8702       Marek Kanievska  Paul Newman, Linda Fiorentino, Dermot Mulroney...
8718            Mel Stuart  Gene Wilder, Jack Albertson, Peter Ostrum, Roy...

                                                country          date_added  \
7     United States, Ghana, Burkina Faso, United Kin...  September 24, 2021
12                              Germany, Czech Republic  September 23, 2021
129                              Germany, United States   September 1, 2021
142                              Germany, United States   September 1, 2021
172                              United States, Germany   September 1, 2021
...                                                 ...                 ...
8590                    United Kingdom, Brazil, Germany     January 1, 2019
8634                            United Kingdom, Germany       July 22, 2019
8641             United States, United Kingdom, Germany     October 1, 2018
8702     Germany, United States, United Kingdom, Canada    January 15, 2020
8718          United States, East Germany, West Germany     January 1, 2020

      release_year rating duration  \
7             1993  TV-MA  125 min
12            2021  TV-MA  127 min
129           2005  PG-13  108 min
142           2007  PG-13  124 min
172           2003  PG-13  110 min
...            ...    ...      ...
8590          2014      R  114 min
8634          2012  PG-13   94 min
8641          2005      R  132 min
8702          2000  PG-13   89 min
8718          1971      G  100 min

                                              listed_in
7      Dramas, Independent Movies, International Movies
12                         Dramas, International Movies
129                                              Dramas
142                                              Dramas
172                          Comedies, Music & Musicals
...                                                 ...
8590              Dramas, Independent Movies, Thrillers
8634               Comedies, Dramas, Independent Movies
8641       Action & Adventure, Dramas, Sci-Fi & Fantasy
8702               Action & Adventure, Comedies, Dramas
8718  Children & Family Movies, Classic Movies, Come...

[183 rows x 11 columns]

**i) Expand the "Duration" column into 2 separate columns – one with numeric value and the other with a string (e.g., "3 seasons" should be split into 3 in one column and "seasons" in another).**

In [212]:
df1[['duration_numeric', 'duration_unit']] = df1['duration'].str.extract('(\d+)\s*(\D+)')
df1['duration_numeric'] = pd.to_numeric(df1['duration_numeric'], errors='coerce')
print(df1[['duration', 'duration_numeric', 'duration_unit']].head())

   duration  duration_numeric duration_unit
0    90 min                90           min
2  1 Season                 1        Season
5  1 Season                 1        Season
6    91 min                91           min
7   125 min               125           min

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\under\AppData\Local\Temp\ipykernel_3456\776181350.py:1: SyntaxWarning: invalid escape sequence '\d'
  df1[['duration_numeric', 'duration_unit']] = df1['duration'].str.extract('(\d+)\s*(\D+)')
C:\Users\under\AppData\Local\Temp\ipykernel_3456\776181350.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[['duration_numeric', 'duration_unit']] = df1['duration'].str.extract('(\d+)\s*(\D+)')
C:\Users\under\AppData\Local\Temp\ipykernel_3456\776181350.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[['duration_numeric', 'duration_unit']] = df1['duration'].str.extract('(\d+)\s*(\D+)')
C:\Users\under\AppData\Local\Temp\ipykernel_3456\776181350.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['duration_numeric'] = pd.to_numeric(df1['duration_numeric'], errors='coerce')

**j)	Split Date added into 3 separate columns having date value in 1st column, month value in 2nd column and year value in 3rd.**

In [215]:
df['date_added'] = pd.to_datetime(df['date_added'], errors='coerce')

# Create separate columns for day, month, and year
df1['Date'] = df['date_added'].dt.day
df1['Month'] = df['date_added'].dt.month
df1['Year'] = df['date_added'].dt.year
print(df1[['Date', 'Month', 'Year']].head())

   Date  Month    Year
0  25.0    9.0  2021.0
2  24.0    9.0  2021.0
5  24.0    9.0  2021.0
6  24.0    9.0  2021.0
7  24.0    9.0  2021.0

C:\Users\under\AppData\Local\Temp\ipykernel_3456\75427579.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Date'] = df['date_added'].dt.day
C:\Users\under\AppData\Local\Temp\ipykernel_3456\75427579.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Month'] = df['date_added'].dt.month
C:\Users\under\AppData\Local\Temp\ipykernel_3456\75427579.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Year'] = df['date_added'].dt.year

**k)	Print the number of TV shows/Movies released in each year.**

In [218]:
release_counts = df1.groupby('Year').size()
print(release_counts)

Year
2008.0       1
2009.0       2
2010.0       1
2011.0      13
2012.0       3
2013.0       7
2014.0      18
2015.0      57
2016.0     239
2017.0     847
2018.0    1209
2019.0    1410
2020.0    1312
2021.0    1026
dtype: int64

**l)	Rename the column title with movie_title.**

In [225]:
df1 = df1.rename(columns={'title': 'movie_title'})
print(df1[['show_id', 'type', 'movie_title']].head())

  show_id     type                       movie_title
0      s1    Movie              Dick Johnson Is Dead
2      s3  TV Show                         Ganglands
5      s6  TV Show                     Midnight Mass
6      s7    Movie  My Little Pony: A New Generation
7      s8    Movie                           Sankofa

**m)	Split Listed_in column into 3 different columns with col name (Genre1, Genre2, Genre3). Split the column based on comma.**

In [228]:
print(df1['listed_in'].head())

0                                        Documentaries
2    Crime TV Shows, International TV Shows, TV Act...
5                   TV Dramas, TV Horror, TV Mysteries
6                             Children & Family Movies
7     Dramas, Independent Movies, International Movies
Name: listed_in, dtype: object

In [230]:
df1[['Genre1', 'Genre2', 'Genre3']] = df1['listed_in'].str.split(',', expand=True)

In [232]:
print(df1[['Genre1', 'Genre2', 'Genre3']].head())

                     Genre1                   Genre2                  Genre3
0             Documentaries                     None                    None
2            Crime TV Shows   International TV Shows   TV Action & Adventure
5                 TV Dramas                TV Horror            TV Mysteries
6  Children & Family Movies                     None                    None
7                    Dramas       Independent Movies    International Movies

**2.	Import both the attached files (student.csv and marks.csv) in Jupyter notebook and perform following operations:**

In [235]:
student_df=pd.read_csv('C:/Users/under/Downloads/student.csv')
marks_df=pd.read_csv('C:/Users/under/Downloads/marks.csv')

**a)	Combine both the dataframes into single dataframe which will have all the records from both the tables.**

In [239]:
combined_df = pd.merge(student_df, marks_df, on='Student_id', how='outer')

In [241]:
combined_df

     Student_id  Age  Gender      Grade Employed  Mark     City
0             1   19    Male  1st Class      yes  95.0  Chennai
1             2   20  Female  2nd Class       no  70.0    Delhi
2             3   18    Male  1st Class       no  98.0   Mumbai
3             4   21  Female  2nd Class       no  75.0     Pune
4             5   19    Male  1st Class       no  89.0    Kochi
..          ...  ...     ...        ...      ...   ...      ...
227         228   21  Female  1st Class       no  99.0     Pune
228         229   20    Male  2nd Class       no  70.0  Chennai
229         230   20    Male  3rd Class      yes  55.0    Delhi
230         231   19  Female  1st Class      yes  97.0   Mumbai
231         232   20    Male  3rd Class      yes  59.0     Pune

[232 rows x 7 columns]

**b)	Print the maximum and minimum marks Gender wise.**

In [244]:
gender_marks = combined_df.groupby('Gender')['Mark'].agg(['max', 'min'])
print(gender_marks)

          max   min
Gender
Female   99.0  40.0
Male    100.0  40.0

**c)	Print all the students IDs and their marks who have scored more than the average marks of the class.**

In [247]:
average_marks = combined_df['Mark'].mean()
above_average = combined_df[combined_df['Mark'] > average_marks][['Student_id', 'Mark']]
print(above_average)

     Student_id  Mark
0             1  95.0
2             3  98.0
3             4  75.0
4             5  89.0
11           12  90.0
..          ...   ...
221         222  74.0
222         223  79.0
224         225  72.0
227         228  99.0
230         231  97.0

[137 rows x 2 columns]

**d)	Print the dataframe who are Males and are Employed.**

In [250]:
males_employed = combined_df[(combined_df['Gender'] == 'Male') & (combined_df['Employed'] == 'yes')]
print(males_employed)

     Student_id  Age Gender      Grade Employed  Mark     City
0             1   19   Male  1st Class      yes  95.0  Chennai
5             6   20   Male  2nd Class      yes  69.0  Gwalior
7             8   21   Male  3rd Class      yes  54.0  Chennai
12           13   19   Male  1st Class      yes  92.0  Gwalior
14           15   19   Male  1st Class      yes  97.0     Pune
16           17   20   Male  2nd Class      yes  68.0  Gwalior
18           19   21   Male  2nd Class      yes  72.0  Chennai
29           30   19   Male  1st Class      yes  81.0  Chennai
34           35   20   Male  2nd Class      yes  79.0  Gwalior
36           37   21   Male  3rd Class      yes  53.0     Pune
41           42   19   Male  1st Class      yes  86.0    Delhi
43           44   19   Male  1st Class      yes  95.0     Pune
45           46   20   Male  2nd Class      yes  79.0    Delhi
47           48   21   Male  2nd Class      yes  67.0     Pune
58           59   19   Male  1st Class      yes  89.0     Pune
63           64   20   Male  2nd Class      yes  78.0    Delhi
65           66   21   Male  3rd Class      yes  59.0     Pune
70           71   19   Male  1st Class      yes  85.0    Kochi
72           73   19   Male  1st Class      yes  89.0   Bhopal
74           75   20   Male  2nd Class      yes  79.0    Delhi
76           77   21   Male  2nd Class      yes  77.0     Pune
87           88   19   Male  1st Class      yes  96.0     Pune
92           93   20   Male  2nd Class      yes  74.0    Kochi
94           95   21   Male  3rd Class      yes  50.0   Bhopal
99          100   19   Male  1st Class      yes  84.0    Kochi
101         102   19   Male  1st Class      yes  98.0  Chennai
103         104   20   Male  2nd Class      yes  78.0   Mumbai
105         106   21   Male  2nd Class      yes  77.0    Kochi
116         117   19   Male  1st Class      yes  90.0    Kochi
121         122   20   Male  2nd Class      yes  75.0   Mumbai
123         124   21   Male  3rd Class      yes  49.0  Chennai
128         129   19   Male  1st Class      yes  89.0  Gwalior
130         131   19   Male  1st Class      yes  90.0  Chennai
132         133   20   Male  2nd Class      yes  75.0   Mumbai
134         135   21   Male  2nd Class      yes  75.0    Kochi
145         146   19   Male  1st Class      yes  98.0   Mumbai
150         151   20   Male  2nd Class      yes  78.0     Pune
152         153   21   Male  3rd Class      yes  46.0  Gwalior
157         158   19   Male  1st Class      yes  92.0     Pune
159         160   19   Male  1st Class      yes  92.0    Delhi
161         162   20   Male  2nd Class      yes  79.0     Pune
163         164   21   Male  2nd Class      yes  75.0  Gwalior
174         175   19   Male  1st Class      yes  84.0     Pune
179         180   20   Male  2nd Class      yes  76.0    Delhi
181         182   21   Male  3rd Class      yes  58.0     Pune
186         187   19   Male  1st Class      yes  83.0    Kochi
188         189   19   Male  1st Class      yes  89.0   Bhopal
190         191   20   Male  2nd Class      yes  77.0    Delhi
192         193   21   Male  2nd Class      yes  75.0     Pune
203         204   19   Male  1st Class      yes  91.0     Pune
208         209   20   Male  2nd Class      yes  70.0   Mumbai
210         211   21   Male  3rd Class      yes  58.0    Kochi
215         216   19   Male  1st Class      yes  95.0   Mumbai
217         218   19   Male  1st Class      yes  96.0    Kochi
219         220   20   Male  2nd Class      yes  75.0   Bhopal
221         222   21   Male  2nd Class      yes  74.0    Kochi
229         230   20   Male  3rd Class      yes  55.0    Delhi
231         232   20   Male  3rd Class      yes  59.0     Pune

**e)	Create a new Column ‘IQ_level’ which will have 3 values (Intelligent, Mediocre, weak). If student scored more than 80 then Tag him as Intelligent, if student scored between 50-80, then Mediocre, else weak.**

In [253]:
combined_df['IQ_level'] = np.where(combined_df['Mark'] > 80, 'Intelligent',
                                    np.where(combined_df['Mark'] >= 50, 'Mediocre', 'Weak'))
print(combined_df[['Student_id', 'Mark', 'IQ_level']])

     Student_id  Mark     IQ_level
0             1  95.0  Intelligent
1             2  70.0     Mediocre
2             3  98.0  Intelligent
3             4  75.0     Mediocre
4             5  89.0  Intelligent
..          ...   ...          ...
227         228  99.0  Intelligent
228         229  70.0     Mediocre
229         230  55.0     Mediocre
230         231  97.0  Intelligent
231         232  59.0     Mediocre

[232 rows x 3 columns]

**f)	Count the number of males and females from each city.**

In [256]:
gender_city_count = combined_df.groupby(['City', 'Gender']).size().unstack(fill_value=0)
print(gender_city_count)

Gender   Female  Male
City
Bhopal       13    15
Chennai      15    18
Delhi        12    20
Gwalior      14    18
Kochi        10    21
Mumbai       16    16
Pune         15    26

**g)	Print the top 5 Male scorers.**

In [259]:
top_male_scorers = combined_df[combined_df['Gender'] == 'Male'].sort_values(by='Mark', ascending=False).head(5)
print(top_male_scorers[['Student_id', 'Mark']])

     Student_id   Mark
149         150  100.0
147         148   99.0
60           61   98.0
62           63   98.0
101         102   98.0

**h)	Replace the Male value with M and Female value with F and export this dataframe to excel file in D: (D drive) and name the file as test.csv.**

In [262]:
combined_df['Gender'] = combined_df['Gender'].replace({'Male': 'M', 'Female': 'F'})
combined_df.to_csv('C:/Users/Under/Downloads/test.csv', index=False) #EXPORTING TO C DRIVE SINCE SYSTEM DOESNT HAVE A D DRIVE

**i)	Check if any student_ID is duplicated.**

In [265]:
duplicated_students = combined_df[combined_df.duplicated(subset='Student_id', keep=False)]
print(duplicated_students)

Empty DataFrame
Columns: [Student_id, Age, Gender, Grade, Employed, Mark, City, IQ_level]
Index: []

**j)	Create a separate dataframe which will have all the Integer/Float variables.**

In [268]:
numeric_df = combined_df.select_dtypes(include=['int64', 'float64'])
print(numeric_df)

     Student_id  Age  Mark
0             1   19  95.0
1             2   20  70.0
2             3   18  98.0
3             4   21  75.0
4             5   19  89.0
..          ...  ...   ...
227         228   21  99.0
228         229   20  70.0
229         230   20  55.0
230         231   19  97.0
231         232   20  59.0

[232 rows x 3 columns]

**k)	Get those Student_IDs which are present in Students table but not in Marks table.**

In [271]:
unique_students = pd.merge(student_df, marks_df, on='Student_id', how='left', indicator=True)
missing_students = unique_students[unique_students['_merge'] == 'left_only']['Student_id']
print(missing_students)

8      9
9     10
48    49
Name: Student_id, dtype: int64

**3.Explain the concept of missing values. How can you identify the missing values in a Pandas DataFrame ?
What are the different ways of treating/Imputing/Deleting the missing values.
Explain with example.**

Missing values occur when data is absent for a particular observation (row) or feature (column) in a dataset. In a Pandas DataFrame, missing values are often represented by NaN (Not a Number) or None.
Missing data can arise for various reasons:
   Errors in data collection (e.g., missing responses in a survey),
   incomplete data entry (e.g., fields left blank in a form),
   data merging or joining issues when combining multiple datasets,
   identifying missing values in a Pandas DataFrame,
   
Pandas provides several methods to identify missing values:

**1. isna() and isnull()** Methods
Both methods return a boolean DataFrame of the same shape as the original, where True indicates the presence of missing values.

In [275]:
data = {'A': [1, 2, None, 4], 
        'B': [None, 2, 3, 4], 
        'C': [1, None, 3, 4]}
df2 = pd.DataFrame(data)
missing = df2.isna()
print(missing)

       A      B      C
0  False   True  False
1  False  False   True
2   True  False  False
3  False  False  False

**2. sum() Method to Count Missing Values**

In [278]:
missing_count = df2.isna().sum()
print(missing_count)

A    1
B    1
C    1
dtype: int64

**3. info() Method:**
The info() method provides a summary of the DataFrame, including the number of non-null values in each column.

In [281]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
dtypes: float64(3)
memory usage: 228.0 bytes

There are several strategies to handle missing data, and the best approach depends on the nature of the data and the problem you're trying to solve.

**1. Imputation (Filling Missing Values):**
Imputation involves filling the missing values with meaningful replacements, such as using the mean, median, mode, or other statistical values, or even more advanced techniques like predictive imputation.

**a) Filling with a constant value:**
    We can replace missing values with a fixed value (e.g., 0, -1, or any other constant).

In [284]:
df_filled = df2.fillna(0)  # Fill all NaNs with 0
print(df_filled)

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  0.0
2  0.0  3.0  3.0
3  4.0  4.0  4.0

   **b) Filling with the mean, median, or mode:**
    Mean imputation is often used for numerical columns,
    Median imputation can be used for skewed distributions,
    Mode imputation can be used for categorical data.

In [287]:
df2['A'] = df2['A'].fillna(df2['A'].mean())  # Fill NaNs in column A with mean of A
print(df2)

          A    B    C
0  1.000000  NaN  1.0
1  2.000000  2.0  NaN
2  2.333333  3.0  3.0
3  4.000000  4.0  4.0

   **c) Forward Fill and Backward Fill:**
    These methods fill the missing values by using the previous or next non-missing value in the column.

    Forward fill (ffill) replaces missing values with the value from the previous row.
    Backward fill (bfill) replaces missing values with the value from the next row.

In [290]:
df_filled_ffill = df2.fillna(method='ffill')
print(df_filled_ffill)

          A    B    C
0  1.000000  NaN  1.0
1  2.000000  2.0  1.0
2  2.333333  3.0  3.0
3  4.000000  4.0  4.0

C:\Users\under\AppData\Local\Temp\ipykernel_3456\2323399587.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df2.fillna(method='ffill')

**2. Dropping Missing Values (Deletion):**
Sometimes, it is better to remove rows or columns with missing values rather than impute them, especially when the missing data is a small proportion of the entire dataset.

 **a) Drop rows with missing values:**
     We can remove any row that contains at least one missing value using dropna().

In [293]:
df_dropped_rows = df2.dropna()  # Drop any rows with NaN values
print(df_dropped_rows)

          A    B    C
2  2.333333  3.0  3.0
3  4.000000  4.0  4.0

   **b) Drop columns with missing values:**
    If a column contains too many missing values and you don't want to impute, you can drop the column.

In [296]:
df_dropped_columns = df2.dropna(axis=1)  # Drop columns with NaN values
print(df_dropped_columns)

          A
0  1.000000
1  2.000000
2  2.333333
3  4.000000

The choice of method depends on the dataset and the amount of missing data. Imputation is preferred when a lot of data is missing, and deletion is useful when only a small portion of the data is missing or if the missing values are unimportant for the analysis.